BizRuntimeTaskOnXML/src/main/java/com/bizruntime/bizrintimetaskonxml/shipment.out.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:v13="http://www.ups.com/XMLSchema/XOLTWS/IF/v1.0" xmlns:v12="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0"
	xmlns:v11="http://www.ups.com/XMLSchema/XOLTWS/Ship/v1.0" xmlns:v1="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0">
	<soapenv:Header>
		<v1:UPSSecurity>
			<v1:UsernameToken>
				<v1:Username>104967</v1:Username>
				<v1:Password>ABBC</v1:Password>
			</v1:UsernameToken>
			<v1:ServiceAccessToken>
				<v1:AccessLicenseNumber>FEDEX_GROUND</v1:AccessLicenseNumber>
			</v1:ServiceAccessToken>
		</v1:UPSSecurity>
	</soapenv:Header>
	<soapenv:Body>
		<v11:ShipmentRequest>
			<v12:Request>
				<v12:RequestOption>123456</v12:RequestOption>
				<v12:TransactionReference>
					<v12:CustomerContext>9739380</v12:CustomerContext>
					<v12:XpciVersion>38017</v12:XpciVersion>
					<v12:TransactionIdentifier>KAR</v12:TransactionIdentifier>
				</v12:TransactionReference>
			</v12:Request>
			<v12:Request>
				<v12:RequestOption>12234</v12:RequestOption>
				<v12:TransactionReference>
					<v12:CustomerContext>1234345</v12:CustomerContext>
					<v12:XpciVersion>100102</v12:XpciVersion>
					<v12:TransactionIdentifier>KAR</v12:TransactionIdentifier>
				</v12:TransactionReference>
			</v12:Request>
			<v12:Request>
				<v12:RequestOption>4567890</v12:RequestOption>
				<v12:TransactionReference>
					<v12:CustomerContext>12</v12:CustomerContext>
					<v12:XpciVersion>10009</v12:XpciVersion>
					<v12:TransactionIdentifier>GZB</v12:TransactionIdentifier>
				</v12:TransactionReference>
			</v12:Request>
			<v11:Shipment>
				<v11:Description>Hitachi</v11:Description>
				<v11:Shipper>
					<v11:Name>FEDEX</v11:Name>
					<v11:AttentionName>FEDEX_GROUND</v11:AttentionName>
					<v11:Phone>
						<v11:Number>3124676543</v11:Number>
						<v11:Extension>Idea</v11:Extension>
					</v11:Phone>
					<v11:ShipperNumber />
					<v11:Address>
						<v11:AddressLine>Basvanpura,K.R.Puram,Bangalore</v11:AddressLine>
						<v11:City>Bangalore</v11:City>
						<v11:StateProvinceCode>KAR</v11:StateProvinceCode>
						<v11:PostalCode>38017</v11:PostalCode>
						<v11:CountryCode>IN</v11:CountryCode>
					</v11:Address>
					<v11:Address>
						<v11:AddressLine>BTM,2nd stage,Bangalore</v11:AddressLine>
						<v11:City>Bangalore</v11:City>
						<v11:StateProvinceCode>KAR</v11:StateProvinceCode>
						<v11:PostalCode>100102</v11:PostalCode>
						<v11:CountryCode>91</v11:CountryCode>
					</v11:Address>
					<v11:Address>
						<v11:AddressLine>PratapVihar,KR Nagar,Ghaziabad</v11:AddressLine>
						<v11:City>Ghaziabad</v11:City>
						<v11:StateProvinceCode>GZB</v11:StateProvinceCode>
						<v11:PostalCode>10009</v11:PostalCode>
						<v11:CountryCode>91</v11:CountryCode>
					</v11:Address>
				</v11:Shipper>
				<v11:ShipTo>
					<v11:Name>Durgesh</v11:Name>
					<v11:Phone>
						<v11:Number>3124676543</v11:Number>
						<v11:Extension>Idea</v11:Extension>
					</v11:Phone>
					<v11:AttentionName />
					<v11:Address>
						<v11:AddressLine>Basvanpura,K.R.Puram,Bangalore</v11:AddressLine>
						<v11:City>Bangalore</v11:City>
						<v11:StateProvinceCode>KAR</v11:StateProvinceCode>
						<v11:PostalCode>38017</v11:PostalCode>
						<v11:CountryCode>IN</v11:CountryCode>
					</v11:Address>
					<v11:Address>
						<v11:AddressLine>BTM,2nd stage,Bangalore</v11:AddressLine>
						<v11:City>Bangalore</v11:City>
						<v11:StateProvinceCode>KAR</v11:StateProvinceCode>
						<v11:PostalCode>100102</v11:PostalCode>
						<v11:CountryCode>91</v11:CountryCode>
					</v11:Address>
					<v11:Address>
						<v11:AddressLine>PratapVihar,KR Nagar,Ghaziabad</v11:AddressLine>
						<v11:City>Ghaziabad</v11:City>
						<v11:StateProvinceCode>GZB</v11:StateProvinceCode>
						<v11:PostalCode>10009</v11:PostalCode>
						<v11:CountryCode>91</v11:CountryCode>
					</v11:Address>
				</v11:ShipTo>
				<v11:ShipFrom>
					<v11:Name />
					<v11:Address>
						<v11:AddressLine>Basvanpura,K.R.Puram,Bangalore</v11:AddressLine>
						<v11:City>MONTGOMERY</v11:City>
						<v11:StateProvinceCode>TX</v11:StateProvinceCode>
						<v11:PostalCode>77356</v11:PostalCode>
						<v11:CountryCode>US</v11:CountryCode>
					</v11:Address>
					<v11:Address>
						<v11:AddressLine>BTM,2nd stage,Bangalore</v11:AddressLine>
						<v11:City>MONTGOMERY</v11:City>
						<v11:StateProvinceCode>TX</v11:StateProvinceCode>
						<v11:PostalCode>77356</v11:PostalCode>
						<v11:CountryCode>US</v11:CountryCode>
					</v11:Address>
					<v11:Address>
						<v11:AddressLine>PratapVihar,KR Nagar,Ghaziabad</v11:AddressLine>
						<v11:City>MONTGOMERY</v11:City>
						<v11:StateProvinceCode>TX</v11:StateProvinceCode>
						<v11:PostalCode>77356</v11:PostalCode>
						<v11:CountryCode>US</v11:CountryCode>
					</v11:Address>
				</v11:ShipFrom>
				<v11:PaymentInformation>
					<v11:ShipmentCharge>
						<v11:Type>SENDER</v11:Type>
						<v11:BillShipper>
							<v11:AccountNumber>510087100</v11:AccountNumber>
						</v11:BillShipper>
					</v11:ShipmentCharge>
				</v11:PaymentInformation>
				<v11:Service>
					<v11:Code />
					<v11:Description />
				</v11:Service>
				<v11:ShipmentServiceOptions>FEDEX</v11:ShipmentServiceOptions>
			</v11:Shipment>
			<v11:LabelSpecification>
				<v11:LabelImageFormat>
					<v11:Code>ZPL</v11:Code>
					<v11:Description>ABCZYZ</v11:Description>
				</v11:LabelImageFormat>
				<v11:LabelStockSize>
					<v11:Height>1</v11:Height>
					<v11:Width>1</v11:Width>
				</v11:LabelStockSize>
			</v11:LabelSpecification>
		</v11:ShipmentRequest>
	</soapenv:Body>
</soapenv:Envelope>